
//Задание №1
let a = +prompt('Введите длину стороны: (см.)');
let P = a * 4;
alert(`${P}`);


/*
//Задание №2
let a = +prompt('Введите длину ребра куба: (см.)');
let v = a ** 3;
let s = (4 * a) ** 2;
alert(`Объем куба = ${v} (см.);`);
alert(`Площадь боковой поверхности = ${s} (см.)`);

//Задание №3
let r = +prompt('Введите радиус окружности: (см.)');
const π = 3.14;
C = π * r;
alert(`Длина окружности = ${C} (см.)`); 

//Задание №4
let m = +prompt('Введите массу вещества: (кг.)');
let v = +prompt('Введите объем вещества: (м.куб.)');
ρ = m / v;
alert(`Плотность вещества = ${ρ} (кг/м.куб.)`);

//Задание №5
let n = +prompt('Введите количество жителей: (чел.)');
let s = +prompt('Введите площадь территории: (км.кв.)');
ρ = s / n;
alert(`Плотность населения = ${ρ} (чел./км.кв)`);

//Задание №6
let a = +prompt('Введите длину первого катета: (см.)');
let b = +prompt('Введите длину второго катета; (см.)');
console.log(Math.hypot(a, b));

//Задание №6
let a = +prompt('Веедите число: ');
let b = (a * a + 10) / Math.sqrt(a * a + 1);
alert(`Y = ${b}`); */










